## Task

In this compulsory task you will clean the country column and parse the date column in the **store_income_data_task.csv** file.

In [1]:
# import all necessary libraries
import pandas as pd
import numpy as np

In [2]:
# Load up store_income_data.csv
df_income = pd.read_table('store_income_data_task.csv', sep=',')

1. Take a look at all the unique values in the "country" column. Then, convert the column to lowercase and remove any trailing white spaces.

In [3]:
#Review the example of the data
df_income.head()
df_income.iloc[:]

,id,store_name,store_email,department,income,date_measured,country
0,1,"Cullen/Frost Bankers, Inc.",NaN,Clothing,$54438554.24,4-2-2006,United States/
1,2,Nordson Corporation,NaN,Tools,$41744177.01,4-1-2006,Britain
2,3,"Stag Industrial, Inc.",NaN,Beauty,$36152340.34,12-9-2003,United States
3,4,FIRST REPUBLIC BANK,ecanadine3@fc2.com,Automotive,$8928350.04,8-5-2006,Britain/
4,5,Mercantile Bank Corporation,NaN,Baby,$33552742.32,21-1-1973,United Kingdom
...,...,...,...,...,...,...,...
995,996,Columbia Sportswear Company,cschooleyrn@sohu.com,Automotive,$52593924.99,7-10-2005,S. AfricaSouth Africa/
996,997,WisdomTree Interest Rate Hedged High Yield Bon...,NaN,Electronics,$60473676.46,19-12-1990,United States
997,998,Tortoise Energy Infrastructure Corporation,cbeardshallrp@ow.ly,Health,$1697293.64,25-4-2009,UNITED STATES OF AMERICA
998,999,Qwest Corporation,NaN,Beauty,$30091863.73,13-1-2011,England
999,1000,SLM Corporation,NaN,Kids,$66106336.48,1-12-2011,united kingdom

In [4]:
#Check numbers of unique country records
country_unique = df_income["country"].unique()
print(f"Number of unique countries: {len(country_unique)}")
country_unique

Number of unique countries: 77

array(['United States/', 'Britain', ' United States', 'Britain/',
       ' United Kingdom', 'U.K.', 'SA ', 'U.K/', 'America',
       'United Kingdom', nan, 'united states', ' S.A.', 'England ', 'UK',
       'S.A./', 'ENGLAND', 'BRITAIN', 'U.K', 'U.K ', 'America/', 'SA.',
       'S.A. ', 'u.k', 'uk', ' ', 'UK.', 'England/', 'england',
       ' Britain', 'united states of america', 'UK/', 'SA/', 'SA',
       'England.', 'UNITED KINGDOM', 'America.', 'S.A..', 's.a.', ' U.K',
       ' United States of America', 'Britain ', 'England', ' SA',
       'United States of America.', 'United States of America/',
       'United States.', 's. africasouth africa', ' England',
       'United Kingdom ', 'United States of America ', ' UK',
       'united kingdom', 'AMERICA', 'America ',
       'UNITED STATES OF AMERICA', ' S. AfricaSouth Africa', 'america',
       'S. AFRICASOUTH AFRICA', 'Britain.', '/', 'United Kingdom.',
       'United States', ' America', 'UNITED STATES', 'sa',
       'United States of America', 'UK ', 'United States ',
       'S. AfricaSouth Africa/', 'S.A.', 'United Kingdom/',
       'S. AfricaSouth Africa ', 'S. AfricaSouth Africa.',
       'S. AfricaSouth Africa', '.', 'britain'], dtype=object)

In [5]:
#Convert to lowercase
df_income["country"] = df_income["country"].str.lower()

#Remove characters that are not alphabetical 
df_income["country"] = df_income["country"].str.replace('[^a-zA-Z ]', '', regex=True)

#Remove trailing space
df_income["country"] = df_income["country"].str.strip()

#Re-check the values
country_unique = df_income["country"].unique()
print(f"Number of unique countries: {len(country_unique)}")
country_unique

Number of unique countries: 11

array(['united states', 'britain', 'united kingdom', 'uk', 'sa',
       'america', nan, 'england', '', 'united states of america',
       's africasouth africa'], dtype=object)

2. Note that there should only be three separate countries. Eliminate all variations, so that 'South Africa', 'United Kingdom' and 'United States' are the only three countries.

In [6]:
# Replace abriviations and less unique inputs
df_income.replace('uk', 'united kingdom', inplace=True)
df_income.replace('britain', 'united kingdom', inplace=True)
df_income.replace('england', 'united kingdom', inplace=True)
df_income.replace('sa', 'south africa', inplace=True)
df_income.replace('united states of america', 'united states', inplace=True)
df_income.replace('america', 'united states', inplace=True)
df_income.replace('s africasouth africa', 'south africa', inplace=True)
df_income['country'] = df_income['country'].replace('', 'Unknown')  # Replace empty strings
df_income['country'] = df_income['country'].fillna('Unknown') # replace nan

In [7]:
#Re-check the values
country_unique = df_income["country"].unique()
print(f"Number of unique countries: {len(country_unique)}")
country_unique

Number of unique countries: 4

array(['united states', 'united kingdom', 'south africa', 'Unknown'],
      dtype=object)

3. Create a new column called `days_ago` in the DataFrame that is a copy of the 'date_measured' column but instead it is a number that shows how many days ago it was measured from the current date. Note that the current date can be obtained using `datetime.date.today()`.

In [13]:
df_income['date_measured'] = pd.to_datetime(df_income['date_measured'], format='%d-%m-%Y')

df_income['days_ago'] = (pd.Timestamp.now() - df_income['date_measured']).dt.days
df_income.head()

,id,store_name,store_email,department,income,date_measured,country,days_ago
0,1,"Cullen/Frost Bankers, Inc.",NaN,Clothing,$54438554.24,2006-02-04,united states,6637
1,2,Nordson Corporation,NaN,Tools,$41744177.01,2006-01-04,united kingdom,6668
2,3,"Stag Industrial, Inc.",NaN,Beauty,$36152340.34,2003-09-12,united states,7513
3,4,FIRST REPUBLIC BANK,ecanadine3@fc2.com,Automotive,$8928350.04,2006-05-08,united kingdom,6544
4,5,Mercantile Bank Corporation,NaN,Baby,$33552742.32,1973-01-21,united kingdom,18704